<?php
// <---------------------------------Получение температуры и влажности из БД для отображения в Красивых окошках-------------------------------------->
            $tempFile = "txt/in-1.txt";
            $fh = fopen($tempFile, 'r');
            $temp = fread($fh, filesize($tempFile));
            fclose($fh);

            $humiFile= "txt/in-2.txt";
            $fh = fopen($humiFile, 'r');
            $humi = fread($fh, filesize($humiFile));
            fclose($fh);
// <--------------------------------------------------------------Конец------------------------------------------------------------------------------>

// <-----------------------------------------------------------Автоматика---------------------------------------------------------------------------->
            $manuautoFile = "txt/manuauto.txt";
            $fh = fopen($manuautoFile, 'r');
            $manuauto = fread($fh, filesize($manuautoFile));
            fclose($fh);

if ($manuauto == 2) {
                if ($temp >= 30 && $humi >= 60) {
                // echo "Температура и Влажность в выше нормы", "<br>", "Требуются действия", "<br>"; 
                $theLed =1;
                $theServo = 90;
                echo "1,", $theLed,";", "<br>";                 // echo "Led: ", $theLed, "<br>";
                echo "3,3,", $theServo,";", "<br>";             // echo "Servo: ", $theServo, "<br>";
        } else {
                // echo "Температура и Влажность в норме", "<br>", "Действия не требуются", "<br>"; 
                $theLed =2;
                $theServo = 20;
                echo "1,", $theLed,";", "<br>";                 // echo "Led: ", $theLed, "<br>";
                echo "3,3,", $theServo,";", "<br>";             // echo "Servo: ", $theServo, "<br>";
        }
}

                                                                // echo "auto: ",$manuauto;
                                                                // echo "<br>";
// <--------------------------------------------------------------Конец------------------------------------------------------------------------------>

// <---------------------------------Принятие данных РУЧНОГО управления серво и светоидиотом--------------------------------------------------------->
if ($manuauto == 1) {
        $ledFile = "txt/out-1.txt";
        $fh = fopen($ledFile, 'r');
        $theLed = fread($fh, filesize($ledFile));
        fclose($fh);
        echo "1,", $theLed,";", "<br>";                         // Первая единица просто так(серьезно, но без нее все ломается), номера массива для подачи команды на диод ON/OFF
        $servoFile = "txt/servo_out.txt";
        $fh = fopen($servoFile, 'r');
        $theServo = fread($fh, filesize($servoFile));
        fclose($fh);
        echo "3,3,", $theServo,";", "<br>";                     // Первая тройка просто так(серьезно, но без нее все ломается), Вторая тройка - Для обозначение номера массива для управления
}
// <--------------------------------------------------------------Конец------------------------------------------------------------------------------>
    ?>